14. Для одномерного массива вычислить произведение первого, третьего и шестого положительных элементов 
    и определить их номера в массиве.

var arr = [-45, 30, 31, -40, 22, -48, -18, -24, -21, 25, -38, 43, 35, 15, -33, -41, -8, 29, 26, 24];

var i, 
    j = -1,
    i1 = i3 = i6 = 0;

for(i = 0; i < arr.length; i++){
  if(arr[i] > 0){
    j = j + 1;
    if (j == 1){
      i1 = i;
    } else if (j == 3){
      i3 = i;
    } else if (j == 6){
      i6 = i;
    }
  }
}
console.log(+arr[i1]+" * "+arr[i3]+" * " +arr[i6] +" = " +arr[i1]*arr[i3]*arr[i6]);
console.log("number in array:" +" 1 elem - " +i1 +"; 3 elem - " +i3 +"; 6 elem - " +i6 +";");

//////////////////////////////////////////////////////
var arr = [-45, 30, 31, -40, 22, -48, -18, -24, -21, 25, -38, 43, 35, 15, -33, -41, -8, 29, 26, 24];
var arr1 = [],
    arr2 = [],
    i = 0, 
    j = 0, 
    i1 = i3 = i6 = -1;

for(var i = 0; i < arr.length; i++){
  if(arr[i] > 0){
   arr1.push(arr[i]);
   arr2.push(i);
  }    
}  
  console.log(arr1[1] +' * ' +arr1[3]+' * '+arr1[6] +' = ' +arr1[1] *arr1[3]*arr1[6]);
  console.log(arr2[1], arr2[3], arr2[6]) 