3. Даны координаты двух полей шахматной доски 
(координаты клетки - это 2 числа от 1 до 8: номер столбца и номер строки), необходимо определить однго ли цвета эти клетки на шахматной доске?

function search(x1,y1,x2,y2){

  return ( ((x1+y1) % 2 == 0) && ((x2+y2) % 2 == 0) ) ? true : false;
}
search( 2,2,4,0 );


<!--====================================================================================
  шахматна доска 8х8
========================================================================================-->

var size = 8; 

var chessDesk = "";

// create func for this purpose;

for (var y = 0; y < size; y++) {  
  for (var x = 0; x < size; x++) {
    if ( (x + y) % 2 == 0 )
      chessDesk += " ";
    else
      chessDesk += "#";
  }
  chessDesk += "\n";
}

console.log( chessDesk );